---
title: ColorWithTransparency
classe: Autodesk.Revit.DB.ColorWithTransparency
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# ColorWithTransparency

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `colorWithTransparency.IsValidObject` | Boolean |
| `Void Dispose()` | `colorWithTransparency.Dispose()` | Void |
| `UInt32 GetBlue()` | `colorWithTransparency.GetBlue()` | UInt32 |
| `Color GetColor()` | `colorWithTransparency.GetColor()` | Color |
| `UInt32 GetGreen()` | `colorWithTransparency.GetGreen()` | UInt32 |
| `UInt32 GetRed()` | `colorWithTransparency.GetRed()` | UInt32 |
| `UInt32 GetTransparency()` | `colorWithTransparency.GetTransparency()` | UInt32 |
| `Void SetBlue(UInt32)` | `colorWithTransparency.SetBlue(blue)` | Void |
| `Void SetColor(Color)` | `colorWithTransparency.SetColor(color)` | Void |
| `Void SetGreen(UInt32)` | `colorWithTransparency.SetGreen(green)` | Void |
| `Void SetRed(UInt32)` | `colorWithTransparency.SetRed(red)` | Void |
| `Void SetTransparency(UInt32)` | `colorWithTransparency.SetTransparency(transparency)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```